Учет_ФК/src/Documents/ВнутреннееПеремещениеПродукции/ВнутреннееПеремещениеПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееПеремещениеПродукции</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ВнутреннееПеремещениеПродукции/ManagerModule.bsl
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("ru = 'Накладная ведомость'");
	КомандаПечати.Порядок       = 10;
	
КонецПроцедуры
#КонецОбласти

Функция НаименованиеСотрудникаДляВизы(Сотрудник)
	
	Если СтрДлина(СокрЛП(Сотрудник.ПредставлениеДляПечати))>0 Тогда
		Возврат СокрЛП(Сотрудник.ПредставлениеДляПечати);
	Иначе 
		Возврат СокрЛП(Сотрудник.Наименование);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Накладная ведомость",
			СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 							= Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерКолонтитулаСверху 	= 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу 	= 0;
	ТабличныйДокумент.ПолеСлева					= 25;
	ТабличныйДокумент.АвтоМасштаб 				= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 		= ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВнутреннееПеремещение_Накладная";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВнутреннееПеремещениеПродукции.Накладная");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого		= Макет.ПолучитьОбласть("Итого");
	ОбластьПодвала 		= Макет.ПолучитьОбласть("Подвал");
	   	
	Для Каждого СсылкаНаОбъект Из МассивОбъектов Цикл 
		
		СтруктураДанныхДляПечати = новый Структура;
		СтруктураДанныхДляПечати.Вставить("НаименованиеОрганизации",		pm_ОбщегоНазначения.ОписаниеОрганизации(СсылкаНаОбъект.Организация,"НаименованиеПолное"));
		СтруктураДанныхДляПечати.Вставить("ДатаОтгрузки",					СсылкаНаОбъект.Дата);
		СтруктураДанныхДляПечати.Вставить("СкладОтправитель",				СсылкаНаОбъект.Склад.Наименование);
		СтруктураДанныхДляПечати.Вставить("СкладПолучатель",				СсылкаНаОбъект.СкладПолучатель.Наименование);
		СтруктураДанныхДляПечати.Вставить("РеквизитыДокумента",				"№ "+СсылкаНаОбъект.Номер+" от "+Формат(СсылкаНаОбъект.Дата,"ДЛФ=ДД"));	
		
		ОбластьШапка.Параметры.Заполнить(СтруктураДанныхДляПечати);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		 
		ТабличнаяЧасть 		= СсылкаНаОбъект.Продукция;
		КоличествоМешков	= ТабличнаяЧасть.Количество();
		ИтогоВес 			= 0;
		Ном 				= 0;
		
		Для Каждого СтрокаТаб Из ТабличнаяЧасть Цикл
			
			ТекущаяПартия	= СтрокаТаб.ПартияПродукции;
			ИтогоВес		= ИтогоВес+СтрокаТаб.ВесБруттоВлажный;
			Ном 			= Ном+1;
			
			СтруктураДанныхДляПечати = новый Структура;
			СтруктураДанныхДляПечати.Вставить("Ном",			Ном);
			СтруктураДанныхДляПечати.Вставить("НаименованиеФК",	ТекущаяПартия.Номенклатура.ПолноеНаименование);
			СтруктураДанныхДляПечати.Вставить("НомПартии",		ТекущаяПартия.Код);
			СтруктураДанныхДляПечати.Вставить("НомМешка",		ПолучитьМестоВПартииНаСервере(Новый Структура("НомерМестаВПартии,ТранспортировочноеМесто",0,СтрокаТаб.ТранспортировочноеМесто)));	
			СтруктураДанныхДляПечати.Вставить("Вес",			СтрокаТаб.ВесБруттоВлажный);
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураДанныхДляПечати);
			ТабличныйДокумент.Вывести(ОбластьСтрока);

		КонецЦикла;
		
		СтруктураДанныхДляПечати = новый Структура;
		СтруктураДанныхДляПечати.Вставить("КолМешков",	КоличествоМешков);
		СтруктураДанныхДляПечати.Вставить("ИтогоВес",	ИтогоВес);
		
		ОбластьИтого.Параметры.Заполнить(СтруктураДанныхДляПечати);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		СтруктураДанныхДляПечати = новый Структура;
		СтруктураДанныхДляПечати.Вставить("ФИООтпустил",		НаименованиеСотрудникаДляВизы(СсылкаНаОбъект.ВизаОтправителя));
		СтруктураДанныхДляПечати.Вставить("ДолжностьОтпустил",	СсылкаНаОбъект.ВизаОтправителя.Должность.Наименование);
		                                                    
		ОбластьПодвала.Параметры.Заполнить(СтруктураДанныхДляПечати);

		ТабличныйДокумент.Вывести(ОбластьПодвала);
				
	КонецЦикла;
		
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПолучитьМестоВПартииНаСервере(СтруктураДанных)
	
	Если СтруктураДанных.ТранспортировочноеМесто.Пустая() Тогда 
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗатаркиТранспортировочныхМест.НомерМеста КАК НомерМеста
		|ИЗ
		|	РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто = &ТранспортировочноеМесто";
	
	Запрос.УстановитьПараметр("ТранспортировочноеМесто", СтруктураДанных.ТранспортировочноеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураДанных.НомерМестаВПартии 	= ВыборкаДетальныеЗаписи.НомерМеста;
	КонецЕсли;
	
	Возврат СтруктураДанных.НомерМестаВПартии;
	
КонецФункции
